FSAndDisk_Test/FS_Disk_SSD_MP400_8TB_NVMe_scripts/mp4008TB_fs_fio_test_read_ranseq/seq_read_block_4K_32_16_jobs.out
seq_read_test: (g=0): rw=read, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=32
...
fio-3.28
Starting 16 processes

seq_read_test: (groupid=0, jobs=16): err= 0: pid=3680137: Tue May 14 07:13:32 2024
  read: IOPS=193k, BW=755MiB/s (791MB/s)(200GiB/271352msec)
    slat (usec): min=2, max=9942, avg=10.08, stdev= 6.56
    clat (usec): min=22, max=32446, avg=2481.74, stdev=2013.74
     lat (usec): min=25, max=32542, avg=2492.00, stdev=2013.82
    clat percentiles (usec):
     |  1.00th=[  277],  5.00th=[  586], 10.00th=[  807], 20.00th=[ 1139],
     | 30.00th=[ 1434], 40.00th=[ 1729], 50.00th=[ 2040], 60.00th=[ 2376],
     | 70.00th=[ 2769], 80.00th=[ 3326], 90.00th=[ 4359], 95.00th=[ 5735],
     | 99.00th=[12125], 99.50th=[14091], 99.90th=[17171], 99.95th=[18220],
     | 99.99th=[20841]
   bw (  KiB/s): min=274968, max=2543109, per=100.00%, avg=829071.07, stdev=20872.98, samples=8158
   iops        : min=68742, max=635772, avg=207265.89, stdev=5218.18, samples=8158
  lat (usec)   : 50=0.01%, 100=0.01%, 250=0.76%, 500=2.85%, 750=4.93%
  lat (usec)   : 1000=6.95%
  lat (msec)   : 2=33.34%, 4=38.77%, 10=10.86%, 20=1.52%, 50=0.02%
  cpu          : usr=7.98%, sys=17.07%, ctx=39879607, majf=0, minf=1926
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=52428800,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
   READ: bw=755MiB/s (791MB/s), 755MiB/s-755MiB/s (791MB/s-791MB/s), io=200GiB (215GB), run=271352-271352msec

Disk stats (read/write):
  nvme0n1: ios=52389573/0, merge=0/0, ticks=129394249/0, in_queue=129394249, util=100.00%

Test Time: 2024-05-14 07:13:32
Device Name: filetest.txt
Device Info: